IRP/src/InformationRegisters/JobQueue/JobQueue.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>JobQueue</name>
 <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
 <resources>
  <name>Start</name>
  <type>
   <types>Date</types>
  </type>
 </resources>
 <resources>
  <name>Status</name>
  <type>
   <types>EnumRef.JobStatus</types>
  </type>
 </resources>
 <resources>
  <name>Description</name>
  <type>
   <types>String</types>
  </type>
 </resources>
 <resources>
  <name>Finish</name>
  <type>
   <types>Date</types>
  </type>
 </resources>
 <resources>
  <name>DifficultLevel</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>2</precision>
   </numberQualifiers>
  </type>
 </resources>
 <resources>
  <name>Log</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </resources>
 <resources>
  <name>Result</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </resources>
 <resources>
  <name>Parameters</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </resources>
 <resources>
  <name>JobID</name>
  <type>
   <types>UUID</types>
  </type>
 </resources>
 <resources>
  <name>UserMessages</name>
  <type>
   <types>String</types>
  </type>
 </resources>
 <dimensions>
  <name>Job</name>
  <type>
   <types>CatalogRef.ExternalFunctions</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/JobQueue/Forms/RecordForm/Module.bsl
// @strict-types

&AtServer
Procedure OnReadAtServer(CurrentObject)
	LogArray = CurrentObject.Log.Get(); // Array of Strings
	Log = StrConcat(LogArray, Chars.LF);
	DataParameters = CommonFunctionsServer.SerializeJSON(CurrentObject.Parameters.Get());
	Result = CommonFunctionsServer.SerializeJSON(CurrentObject.Result.Get());
EndProcedure
